I see the same thing. Now when I run a plan after importing my existing pool attachments, it still says they need to be added again.

[1m  # module.bigip_ltm_pool_attachment.bigip_ltm_pool_attachment.attach-pool1-node1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "bigip_ltm_pool_attachment" "attach-pool1-node1" {
      [32m+[0m [0m[1m[0mconnection_limit[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mconnection_rate_limit[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdynamic_ratio[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mnode[0m[0m                  = "node1:80"
      [32m+[0m [0m[1m[0mpool[0m[0m                  = "/Common/pool1"
      [32m+[0m [0m[1m[0mpriority_group[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mratio[0m[0m                 = (known after apply)
    }

[1m  # module.bigip_ltm_pool_attachment.bigip_ltm_pool_attachment.attach-pool2-node2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "bigip_ltm_pool_attachment" "attach-pool2-node2" {
      [32m+[0m [0m[1m[0mconnection_limit[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mconnection_rate_limit[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdynamic_ratio[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mnode[0m[0m                  = "node2:80"
      [32m+[0m [0m[1m[0mpool[0m[0m                  = "/Common/pool2"
      [32m+[0m [0m[1m[0mpriority_group[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mratio[0m[0m                 = (known after apply)
    }

Not sure what it will do if I just apply the pool attachment additions over my existing pool attachments.